# An example using python 3 type checking

#+BEGIN_SRC python :session type-checking
  def numbers() -> int:
      'a silly generator that shows its state'
      for i in range(1024):
          print(f"i: {i}")
          yield i
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session type-checking
  def sum_to(n: int) -> int:
      sum: int = 0
      for i in numbers():
          if i == n: break
          sum += i
      return sum
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session type-checking :results output
  sum_to(4)
#+END_SRC

#+RESULTS:
: i: 0
: i: 1
: i: 2
: i: 3
: i: 4
: 6
